[
  {
    "title": "The Hakata Witness",
    "source_concept": "Peripheral Vision / Holographic Memory",
    "plot_beat": "Detective Arrow enters a crime scene cluttered with distractions. Instead of focusing on specific clues, he enters the 'Learning State' (peripheral vision), allowing his awareness to expand. He senses a disruption in the 'context' of the room—a missing item that implies the killer took a trophy—demonstrating that the whole is contained in the parts.",
    "synopsis": "Arrow teaches his rookie partner that 'focal vision' is for content, but 'peripheral vision' is for context. By softening his gaze, Arrow detects the subtle absence of a personal object on the victim's desk, a detail invisible to the standard forensic team focused on the blood spatter."
  },
  {
    "title": "The Cartesian Trap",
    "source_concept": "Quantum Linguistics / Cartesian Logic",
    "plot_beat": "Interrogating a suspect who has a rehearsed alibi, Arrow utilizes Cartesian Logic to break their loop. He asks not just 'Did you do it?' but moves through the four quadrants: 'What would happen if you didn't do it? What wouldn't happen if you didn't not do it?'",
    "synopsis": "The suspect's mind jams trying to process the multidimensional questions. The linguistic confusion bypasses their conscious firewall, causing them to inadvertently reveal knowledge of the weapon, proving that 'One and one doesn't always equal two' in the human mind."
  },
  {
    "title": "The Uncertainty Principle",
    "source_concept": "Heisenberg Uncertainty Principle / Confusion to Order",
    "plot_beat": "Arrow hits a dead end where the evidence is contradictory. Instead of forcing a logical conclusion, he intentionally induces a state of 'Not Knowing' (confusion) within himself, trusting that the confusion is simply the precursor to a higher level of order.",
    "synopsis": "Referencing Heisenberg, Arrow explains that knowing everything is impossible and limits perception. By embracing the chaos of the case, his unconscious mind reorganizes the fragmented clues, revealing a pattern connecting the victims that linear logic had obscured."
  },
  {
    "title": "The Negotiator of Parts",
    "source_concept": "Parts Integration / Hierarchy of Ideas",
    "plot_beat": "A key witness is catatonic, torn between a 'Protector' part that wants silence for safety and a 'Citizen' part that wants to speak. Arrow acts as a mediator, not between two people, but between the two conflicting neural networks within the witness.",
    "synopsis": "Arrow chunks up to find the 'Higher Intention' of both parts (preservation of life). Once the parts realize they share the same goal, Arrow facilitates an integration. The witness's physical tremors stop, and they lucidly identify the killer, illustrating that internal conflict is just a lack of integration."
  },
  {
    "title": "The Starter's Dilemma",
    "source_concept": "Prime Concerns (Start/Change/Stop)",
    "plot_beat": "Profiling the antagonist, Arrow identifies their Prime Concern filter: they are excellent at 'Starting' chaos but neurologically incapable of 'Stopping' it. Arrow sets a trap that requires the villain to cease an action to escape.",
    "synopsis": "The villain has rigged a device that accelerates over time. Arrow corners them in a situation where the only way out is to shut down the machine. paralyzed by their own neural inability to 'Stop' things, the villain hesitates, allowing Arrow to make the arrest."
  }
]